import React, { Dispatch, SetStateAction } from 'react';
import { useWindowDimensions } from 'services/hooks/useDimensions/useWindowDimension';
import { EDimensions } from 'shared/constans';

import QuestionRender from './question-render';
import { useStyles } from './styles';

const services = [
  {
    key: 1,
    title: 'Ручна ліпосакція',
    description:
      'це авторська методика корекції проблемних зон. Особливість техніки в тому, ' +
      'що вона поєднує одразу декілька найефективніших способів боротьби з целюлітом та зайвими сантиметрами',
  },
  {
    key: 2,
    title: 'Обгортання',
    description:
      'необхідні для того, щоб: зменшити об’єми тіла в найкоротші сроки, вивести зайву рідину, ' +
      'позбавитись набряклості, підвищити пружність шкіри, зменшити прояви целюліту.',
  },
  {
    key: 3,
    title: 'Ліполітики',
    description:
      'домомогають боротися з локальними жировими відкладеннями, ' +
      'які не йдуть за допомогою харчування, чи ручної ліпосакції, та частіш за все, мають невеликий об’єм.',
  },
  {
    key: 4,
    title: 'Ліфтинг обличчя',
    description:
      'це повністю авторська програма, в якій об`єднані найефективніші' +
      'методики масажу обличчя таким чином, щоб вже з першої процедури ви побачили ВАУ. Проводиться в декілька етапів.',
  },
  {
    key: 5,
    title: 'Мікроотики',
    description:
      'контури обличчя стають чіткішими, з’являються заповітні «кути молодості». ' +
      'Зникають заломи, а також ця процедура запобігає їх появі. ' +
      'Звужуються пори і нормалізується вироблення шкірного сала. Шкіра обличчя та тон шкіри вирівнюються.',
  },
  {
    key: 6,
    title: 'Тейпування',
    description:
      'тейп спеціальним чином наклеюється на шкіру, створюючи натяг,' +
      'і тим самим піднімає шкіру і підшкірну жирову клітковину, в якій розташовується целюліт. ' +
      'Відбувається виведення рідини і токсинів, начебто вам постійно роблять лімфодренажний масаж.',
  },
  {
    key: 7,
    title: 'Блейдінг',
    description:
      'унікальна технологія, за якої ефективність масажу збільшується в кілька разів. ' +
      'Завдяки блейдам, які вироблені з медичної сталі, можна опрацювати ті зони, до яких складно добратися руками. ' +
      'Він не травмує судини та прибирає спайки фасцій, які утворюють той самий целюліт у вигляді бугорців та ямок.',
  },
  {
    key: 8,
    title: 'Лімфодренажний масаж',
    description:
      'необхідний вам, якщо ви схильні до набряків, відчуваєте втому вже зранку, ' +
      'а ввечері часто помічаєте сліди від носочків та одягу на тілі. ' +
      'Процедура робиться на все тіло, займає 60 хвилин, покращує стан шкіри, ' +
      'самопочуття, якість сну, підвищує імунітет та виводить зайву рідину.',
  },
  {
    key: 9,
    title: 'Масаж спини',
    description:
      'окремий вид задоволення, який допоможе зняти напругу з м’язів та розправити плечі,' +
      ' рекомендуємо відвідувати регулярно, задля ідеальної постави ' +
      'та впевненої ходи. Адже здорова спина - це дуже красиво.',
  },
  {
    key: 10,
    title: 'Загальний масаж',
    description:
      'Передбачає активне залучення всіх частин тіла. На кожну зону відводиться близько 10 хвилин, ' +
      'ви відчуваєте кожен м’яз свого тіла, кровоносна та ' +
      'лімфатична система активуються, а кожна клітина організму наповнюється киснем. ' +
      'Цією процедурою ідеально завершити складний тиждень, або, навпаки, розпочати новий.',
  },
];
const Services: React.FC<{
  isTestModalOpen: boolean;
  setTestModalOpen: Dispatch<SetStateAction<boolean>>;
}> = ({ isTestModalOpen, setTestModalOpen }) => {
  const classes = useStyles();
  const dimensions = useWindowDimensions();
  return (
    <>
      <span className={classes.title}>Види послуг</span>
      <div className={classes.servicesWrapper}>
        {services.map(({ key, title, description }) => (
          <div className={classes.serviceItem} key={key}>
            <div className={classes.serviceWrapper}>
              <span className={classes.serviceNumber}>{key}</span>
              <span className={classes.serviceTitle}>{title}</span>
              <p className={classes.serviceDescription}>{description}</p>
            </div>
          </div>
        ))}
      </div>
      <div className={classes.quest_wrapper}>
        <p className={classes.questTitle}>
          Ми створили тест, який допоможе підібрати необхідний комплекс процедур
          саме для тебе, пройди його та отримай знижку на будь-який абонемент.
        </p>
        {dimensions === EDimensions.SMALL && (
          <div
            className={classes.button}
            onClick={() => setTestModalOpen(true)}
          >
            Пройти тест
          </div>
        )}
        {dimensions !== EDimensions.SMALL && <QuestionRender />}
      </div>
    </>
  );
};

export default Services;
